docs/notes/capturas/base64-sendmessage.xml

WSDL SCHEMA DEFINITION FOR ATTACHMENT


<xs:complexType name="attachment">
   <xs:sequence>
      <xs:element name="content" type="xs:base64Binary" minOccurs="0"/>
      <xs:element name="link" type="xs:string" minOccurs="0"/>
      <xs:element name="name" type="xs:string" minOccurs="0"/>
   </xs:sequence>
</xs:complexType>



REQUEST SOAP MESSAGE


<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:met="http://Metro.Services.Babylon/">
   <soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
      <wsa:Action>http://Metro.Services.Babylon/MessageService/SendMessageRequest</wsa:Action>
      <wsa:MessageID>uuid:b993b6f9-91f9-4be5-a8a9-b0694b2e0e32</wsa:MessageID>
      <wsa:To>http://localhost:8084/Babylon.Services.Metro/MessageService</wsa:To>
   </soap:Header>
   <soap:Body>
      <met:SendMessage>
         <message>
            <!-- Adjuntos -->
            <attachments>
               <!-- Contenido del adjunto -->
               <content>cid:1039551281089</content>
               <!-- Link del adjunto -->
               <link>http://www.whatever.com</link>
               <!-- Nombre del adjunto -->
               <name>Foto BMW</name>
            </attachments>
            <attachments>
               <!-- Contenido del adjunto -->
               <content>cid:1039551281090</content>
               <!-- Link del adjunto -->
               <link>http://www.whatever.com</link>
               <!-- Nombre del adjunto -->
               <name>Foto Ferrari</name>
            </attachments>
            <!-- Cuerpo del mensaje -->
            <body>Os paso unas fotos de coches...</body>
            <id></id>
            <!-- Destinatarios del mensaje -->
            <recipients>ad380695-eb58-4471-b922-29a05b574b3a</recipients>
            <recipients>b6564583-fbaf-4079-a885-bd9bb47d1565</recipients>
            <!-- Remitente del mensaje -->
            <sender>f4bbdf9f-bddf-4304-a28a-0c84088a0bc1</sender>
            <!-- Fecha del envío -->
            <sentOn></sentOn>
            <!-- Asunto del mensaje -->
            <subject>Asunto del mensaje con adjuntos</subject>
         </message>
      </met:SendMessage>
   </soap:Body>
</soap:Envelope>



RESPONSE SOAP MESSAGE


<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
   <soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
      <wsa:To>http://www.w3.org/2005/08/addressing/anonymous</wsa:To>
      <wsa:Action>http://Metro.Services.Babylon/MessageService/SendMessageResponse</wsa:Action>
      <wsa:MessageID>uuid:cbc0b237-b565-4532-a1fc-081f738226d7</wsa:MessageID>
      <wsa:RelatesTo>uuid:c1c79506-19fa-4c3a-87a6-f94b8cb21c49</wsa:RelatesTo>
   </soap:Header>
   <soap:Body>
      <met:SendMessageResponse xmlns:met="http://Metro.Services.Babylon/">
         <return>f57de938-5e01-11e1-b23e-08002708b83c</return>
      </met:SendMessageResponse>
   </soap:Body>
</soap:Envelope>

